7767517
29 33
Input            actual_input             0 1 actual_input
MemoryData       dense.bias               0 1 dense.bias 0=38
MemoryData       map_to_seq.bias          0 1 map_to_seq.bias 0=64
Convolution      Conv_0                   1 1 actual_input 45 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728
ReLU             Relu_1                   1 1 45 46
Pooling          MaxPool_2                1 1 46 47 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      Conv_3                   1 1 47 48 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             Relu_4                   1 1 48 49
Pooling          MaxPool_5                1 1 49 50 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      Conv_6                   1 1 50 51 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             Relu_7                   1 1 51 52
Convolution      Conv_8                   1 1 52 53 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             Relu_9                   1 1 53 54
Pooling          MaxPool_10               1 1 54 55 0=0 1=1 11=2 2=1 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      Conv_11                  1 1 55 368 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1179648
ReLU             Relu_12                  1 1 368 58
Convolution      Conv_13                  1 1 58 371 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             Relu_14                  1 1 371 61
Pooling          MaxPool_15               1 1 61 62 0=0 1=1 11=2 2=1 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      Conv_16                  1 1 62 63 0=512 1=2 11=2 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1048576
ReLU             Relu_17                  1 1 63 64
Reshape          Reshape_35               1 1 64 82 0=31 1=512
Permute          Transpose_36             1 1 82 83 0=1
InnerProduct     MatMul_37                1 1 83 85 0=64 1=0 2=32768
BinaryOp         Add_38                   2 1 85 map_to_seq.bias 86 0=0
LSTM             LSTM_48                  1 3 86 225 221 222 0=256 1=131072 2=2
LSTM             LSTM_61                  1 3 225 364 360 361 0=256 1=1048576 2=2
InnerProduct     MatMul_65                1 1 364 366 0=38 1=0 2=19456
BinaryOp         Add_66                   2 1 366 dense.bias output 0=0
